Repository: rinrinne/IDEA_resources_jp
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Directory Does Not Exist
ja: ディレクトリが存在しません

source: Directory is invalid {0}
ja: ディレクトリは無効な {0} です

source: Directory is not readable {0}
ja: ディレクトリは参照できない {0} です

source: Directory {0}
ja: ディレクトリ {0}

source: Directory {0} contains read-only file(s).
ja: ディレクトリ {0} には読み取り専用ファイルがあります。

source: Disable
ja: 無効化

source: Disable mnemonics in &menu
ja: メニューのニーモニックを無効にする(&M)

source: Disconnect
ja: 切断

source: Disconnected from the target VM, address: ''{0}'', transport: ''{1}''
ja: ターゲット VM から切断しました。アドレス : ''{0}、トランスポート : ''{1}''

source: Display
ja: 表示

source: Display name:
ja: 表示名:

source: Display settings &before launching
ja: 実行/デバッグ前に設定を表示する(&B)

source: Displays a string input dialog
ja: 文字入力ダイアログの表示

source: Do Not Mark
ja: マークしない

source: Do not Indent Children Of
ja: 次のタグの子はインデントしない

source: Do not indent children of:
ja: 次のタグの子はインデントしない :

source: Do not show duplicates simpler than
ja: 次よりも単純な重複は表示しない

source: Do not show this dialog in the future
ja: 次回からこのダイアログを表示しない

source: Do not step &into the classes
ja: クラスにステップ インしない(&I)

source: Do not wrap one line comments
ja: 1 行のコメントは折り返さない

source: Do you really want to uninstall plugin ''{0}''?
ja: プラグイン "{0}" をアンインストールしますか ?

source: Do you really want to uninstall these {0} plugins ?
ja: プラグイン "{0}" をアンインストールしますか ?

source: Do you want to add exceptions to method signatures in the whole method hierarchy?
ja: メソッド階層全体でメソッド シグネチャに例外を追加しますか ?

source: Do you want to change inheritors' visibility to visibility of the base method?
ja: 継承の可視性をベース メソッドの可視性に変更しますか ?

source: Do you want to create it?
ja: 作成しますか ?

source: Do you want to disconnect from the process ''{0}''?
ja: プロセス "{0}" から切断しますか ?

source: Do you want to remove other assignments?
ja: 他への割り当てを削除しますか ?

source: Do you want to remove the reference to {0}?
ja: {0} への参照を削除しますか ?

source: Do you want to search for accessors of ''{0}''?
ja: ''{0}'' のアクセッサを検索しますか ?

source: Do you want to search usages of parameter ''{0}'' in overriding methods?
ja: オーバーライドされたメソッド内のパラメータ ''{0}'' の使用箇所を検索しますか ?

source: Do you want to try again?
ja: 再試行しますか？

source: Document these tags
ja: タグのドキュメント

source: Don't show again
ja: これ以上表示しない

source: Double Click
ja: ダブル クリック

source: Double Click is not supported for Button {0}
ja: {0}ボタンへのダブルクリックはサポートされていません。

source: Download Plugins
ja: プラグインのダウンロード

source: Download and Install
ja: プラグインのダウンロードとインストール

source: Downloading Plugins
ja: プラグインのダウンロード中

source: Downloading list of plugins from {0}
ja: プラグインのリストをダウンロードしています

source: Downloading plugin ''{0}''
ja: プラグイン ''{0}'' をダウンロードしています

source: Downloads
ja: ダウンロード

source: Draw border
ja: 罫線を描画する

source: Dummy
ja: ダミー

source: Dumping XML...
ja: XML出力中...

source: Duplicate &keys
ja: 重複するキー(&K)

source: Duplicate &values
ja: 重複する値(&V)

source: Duplicate @param tag for parameter ''{0}''
ja: パラメータ ''{0}'' の @param タグの重複

source: Duplicate @throws or @exception tag for exception ''{0}''
ja: 例外 ''{0}'' の @throws または @exception タグの重複

source: Duplicate @{0} tag
ja: @{0} タグの重複

source: Duplicate Property
ja: 重複するプロパティ

source: Duplicate Property Key ''{0}'' #end With Values:<br>
ja: 値が重複するプロパティ キー ''{0}'' #end :<br>

source: Duplicate Property Key ''{0}'' With Different Values #end :<br>
ja: 異なる値 #end が重複するプロパティ キー ''{0}'' :<br>

source: Duplicate Property Value ''{0}'' #end With Keys:<br>
ja: キーが重複するプロパティ値 ''{0}'' #end :<br>

source: Duplicates
ja: 重複

source: E&ntire scope
ja: すべてのスコープ(&N)

source: E&valuate
ja: 評価(&V)

source: E-mail:
ja: 電子メール:

source: ERROR
ja: エラー

source: Each resource pattern may contain the following wildcards: ?
ja: 各リソース パターンには次のワイルドカードを含めることができます: ?

source: Edi&t...
ja: 編集(&T)...

source: Edit
ja: 編集

source: Edit &Global Settings
ja: グローバル設定の編集(&G)

source: Edit Action &Icon...
ja: アクション アイコンの編集(&I)

source: Edit File Type
ja: ファイルタイプの編集

source: Edit Filter
ja: フィルタの編集

source: Edit Filters
ja: フィルタの編集

source: Edit Keyword
ja: キーワードの編集

source: Edit Log Files Aliases
ja: ログ ファイル エイリアスの編集

source: Edit Macros
ja: マクロの編集

source: Edit Pattern
ja: パターンの編集

source: Edit Quick List
ja: クイック リストの編集

source: Edit Settings
ja: 設定の編集

source: Edit Variable
ja: 変数の編集

source: Edit Wildcard
ja: ワイルドカードの編集

source: Editor
ja: エディタ

source: Editor Actions
ja: エディタのアクション

source: Editor Font
ja: エディタのフォント

source: Editor Popup Menu
ja: エディタ ポップアップ メニュー

source: Editor Tab Popup Menu
ja: エディタ タブ ポップアップ メニュー

source: Editor incremental search
ja: エディタ インクリメンタル サーチ

source: Editor {0}
ja: エディタ {0}

source: Editor//Selection background
ja: 選択バックグラウンド

source: Editor//Selection foreground
ja: 選択フォアグラウンド

source: Effects
ja: 効果

source: Empty file mask
ja: 空のファイル マスク

source: Empty method
ja: 空のメソッド

source: Empty method overrides empty method
ja: 空のメソッドが空のメソッドをオーバーライドする。

source: Enable
ja: 有効化

source: Enable 't&oString()' object view:
ja: 'toString()' オブジェクト ビューを有効にする(&O):

source: Enable JavaDoc formatting
ja: JavaDoc フォーマットを使用する

source: Enable UI forms compilation (requires "javac2" ant task from IDEA distribution)
ja: UI フォーム コンパイルを許可 (IDEA の配布による "javac2" ant タスクが必要)

source: Enable alternative view for Coll&ections classes
ja: コレクション クラスの代替ビュー(&C)

source: Enable leading asterisks
ja: 行頭のアスタリスク (*) を許可する

source: Enable:
ja: 有効:

source: Enabled
ja: 有効

source: Encapsulation issues
ja: カプセル化問題

source: End (on blank line)
ja: 空白行での End キー

source: Enter Exception Class
ja: 例外クラスの入力

source: Enter Keyboard Shortcut
ja: キーボード ショートカットの入力

source: Enter Macro Name
ja: マクロ名の入力

source: Enter Mouse Shortcut
ja: マウス ショートカットの入力

source: Enter New Name
ja: 新しい名前を入力してください

source: Enter a file name to create a new {0} {1}
ja: 新しく作成する {0} プロジェクトのファイル名を入力してください{1}

source: Enter a new @interface name:
ja: 新規 @interface 名を入力してください :

source: Enter a new class name:
ja: 新規クラス名を入力してください:

source: Enter a new file name:
ja: 新規ファイル名を入力してください

source: Enter a new interface name:
ja: 新規インターフェイス名を入力:

source: Enter a new package name:
ja: 新規パッケージ名を入力してください :

source: Enter class name:
ja: クラス名を入力してください :

source: Enter file name:
ja: ファイル名を入力してください :

source: Enter instance ID:
ja: インスタンス ID の入力 :

source: Enter macro name.
ja: マクロ名を入力してください。

source: Enter new directory name:
ja: 新規ディレクトリ名を入力してください :

source: Enter new library name
ja: 新規ライブラリ名を入力してください

source: Enter new module name
ja: 新規モジュール名を入力してください

source: Enter new package name:
ja: 新規パッケージ名を入力してください :

source: Enter parameters:
ja: パラメータを入力してください :

source: Enter relative path to module content root (example: java{0}src):
ja: モジュール コンテント ルート (例 : java{0}src) への相対パスを入力してください :

source: Enter symbol name:
ja: シンボル名を入力してください :

source: Enter tag name:
ja: タグ名称を入力してください \:

source: Enter the expression
ja: 式の入力

source: Enter {0} file location
ja: プロジェクト ファイルの場所を入力してください

source: Entity reference
ja: エンティティ参照

source: Entry in the classpath the element belongs to
ja: 要素が属するクラスパス内のエントリ

source: Entry in the sourcepath the element belongs to
ja: 要素が属するソースパス内のエントリ

source: Equality operators (==, !=)
ja: 等価演算子 (==、!=)

source: Error
ja: エラー

source: Error Reading File
ja: ファイルの読み込みエラー

source: Error Report
ja: エラー レポート

source: Error Writing File
ja: ファイルの書き込みエラー

source: Error adding module to project: {0}
ja: モジュールのプロジェクト追加エラー : {0}

source: Error connecting to remote process.
ja: リモート プロセスへの接続エラー。

source: Error copying {0} to {1}: {2}
ja: {0} の {1} へのコピーエラー: {2}

source: Error description (optional):
ja: エラーの詳細 (オプション):

source: Error evaluating field : ''{0}''
ja: フィールドの評価エラー : ''{0}''

source: Error evaluating method : ''{0}''
ja: メソッドの評価エラー : ''{0}''

source: Error handling
ja: エラー処理

source: Error highlighting
ja: エラーの強調表示

source: Error reading color scheme from {0}
ja: {0} からのカラー スキーム読み込みエラー

source: Error reading file {0}.
ja: ファイル {0} の読み込みエラー。

source: Error report sending failed.
ja: エラー レポートの送信に失敗しました。

source: Error saving license data.
ja: ライセンス情報の保存エラー。

source: Error stripe mark
ja: エラー表示マーク

source: Error stripe mark min height (pixels):
ja: エラー表示マークの高さ (ピクセル):

source: Error writing settings.
ja: 設定の書き込みエラー。

source: Error writing to file: {0}
ja: ファイルの書き込みエラー: {0}

source: Error writing to {0}
ja: {0} への書き込みエラー

source: Error: {0}
ja: エラー: {0}

source: Evaluating {0}
ja: {0} を評価しています

source: Evaluating...
ja: 評価...

source: Evaluation is not supported during another method''s evaluation
ja: 他のメソッドの評価中での評価はサポートされていません

source: Exception ''{0}'' in thread ''{1}''
ja: スレッド ''{1}'' 内の例外 ''{0}''

source: Exception ''{0}'' occurred in thread ''{1}'' at {2}({3}:{4,number,#})
ja: 例外 ''{0}'' がスレッド ''{1}'' の{2}({3}:{4,number,#})で発生しました

source: Exception breakpoint reached
ja: 例外ブレークポイントに達しました

source: Exception in <b>{0} core</b>.
ja: <b>{0} コア</b>による原因。

source: Exception in plugin <b>{0}</b>.
ja: プラグイン<b>{0}</b>による原因。

source: Exception occurred: {0} Exception message: {1}
ja: 例外が発生しました : {0} 例外メッセージ : {1}

source: Exception while reloading classes : {0} : {1}
ja: クラスの再読み込み中の例外 : {0} : {1}

source: Exclude
ja: 除外

source: Exclude Recursively
ja: 再帰的に除外

source: Execute Target Before Run/Debug
ja: 実行/デバッグの前にターゲットを実行

source: Execute on
ja: 実行

source: Executing task: {0}
ja: タスクの実行 : {0}

source: Execution
ja: 実行

source: Execution line
ja: 実行ライン

source: Exit
ja: 終了

source: Expand All
ja: すべて展開

source: Expand all build file nodes
ja: すべてのビルド ファイル ノードを展開

source: Expand all test suites
ja: すべてのテスト スイートを展開

source: Expected
ja: 予想

source: Expected :
ja: 予想:

source: Explicit type arguments can be inferred
ja: 明示的なタイプ引数は推測されます

source: Export
ja: エクスポート

source: Export Complete
ja: エクスポートの正常終了

source: Export File Location
ja: エクスポート先ファイルの場所

source: Export Preview
ja: プレビューのエクスポート

source: Export Settings
ja: 設定のエクスポート

source: Export Threads
ja: スレッドのエクスポート

source: Export To
ja: エクスポート先

source: Export settings to:
ja: 設定のエクスポート:

source: Export to file:
ja: ファイルにエクスポート:

source: Export...
ja: エクスポート...

source: Expression
ja: 式

source: Expression &Mode
ja: 式モード(&M)

source: Expression Evaluation
ja: 式評価

source: Expression of type java.util.ResourceBundle, instance of which is available in this context.
ja: 型 java.util.ResourceBundle (このコンテキストで利用可能なインスタンス) の式。

source: Expression type unknown: {0}
ja: 式のタイプが不明です : {0}

source: Extend Class from
ja: クラスの拡張

source: Extends list
ja: リストの拡張

source: External Tools
ja: 外部ツール

source: F&orward
ja: 次へ(&O)

source: Failed to backup file {0}
ja: ファイル {0} のバックアップに失敗しました

source: Failed to create directory "{0}"
ja: ディレクトリ"{0}" の作成に失敗しました

source: Failed to establish connection to the target VM, address: ''{0}'', transport: ''{1}''
ja: ''{1}'' トランスポートを使用する ''{0}'' でのターゲット VM への接続を確立できませんでした。

source: Failed to evaluate breakpoint condition ''{0}'' Reason: {1}
ja: ブレークポイント条件の評価に失敗しました。 ''{0}'' 原因 : {1}

source: Failed to generate ant build script: {0}
ja: Ant ビルド スクリプトの生成に失敗しました: {0}

source: Failed to generate temporary html wrapper for applet class
ja: アプレット クラスのテンポラリ html ラッパーの生成に失敗しました

source: Failed to make the following files writable:{0}
ja: 次のファイルを書き込み可能にできません:{0}

source: Failed to make {0} writeable.
ja: {0} を書き込み可能にできません。

source: Failed to start
ja: 起動に失敗

source: Favorites View Popup Menu
ja: お気に入りビュー ポップアップ メニュー

source: Favorites list with name ''{0}'' already exists
ja: お気に入りリスト ''{0}'' は既に存在します

source: Feature
ja: 機能

source: Field
ja: フィールド

source: Field &modification
ja: フィールド変更(&M)

source: Field ''{2}'' not found
ja: フィールド ''{2}'' がありません

source: Field acce&ss
ja: フィールド アクセス(&S)

source: Field can be converted to a local variable
ja: フィールドはローカル変数に変換できます。

source: Field can be local
ja: フィールドはローカルにできます

source: Field name:
ja: フィールド名:

source: Field watchpoint reached
ja: フィールドのウォッチポイントに達しました

source: Field:
ja: フィールド :

source: File ''{0}'' not found; breakpoints for this file will be ignored
ja: ファイル ''{0}'' がありません。このファイルのブレークポイントは無視されます

source: File - $FILE$
ja: ファイル - $FILE$

source: File Already Exists
ja: ファイルは既に存在します

source: File Creation Failed
ja: ファイル作成失敗

source: File Is Read-Only
ja: ファイルは読み取り専用です

source: File Not Found
ja: ファイルが見つかりません

source: File Status
ja: ファイルのステータス

source: File Structure
ja: ファイル構造

source: File Template Error
ja: ファイル テンプレート エラー

source: File Types
ja: ファイルタイプ

source: File copying compiler
ja: コンパイラにファイルをコピー

source: File dir relative to the module content root the file belongs to
ja: ファイルが属するモジュール コンテント ルートへの相対ファイル ディレクトリ

source: File dir relative to the module content root the file belongs to (with forward slashes)
ja: ファイルが属するモジュール コンテント ルートへの相対ファイル ディレクトリ (スラッシュ記号 (/) を使用)

source: File dir relative to the sourcepath root the file belongs to
ja: ファイルが属するソースパス ルートへの相対ファイル パス

source: File dir relative to the sourcepath root the file belongs to (with forward slashes)
ja: ファイルが属するソースパス ルートへの相対ファイル パス (スラッシュ記号 (/) を使用)

source: File directory
ja: ファイル ディレクトリ

source: File header
ja: ファイル ヘッダー

source: File m&ask(s)
ja: ファイル マスク(&M)

source: File name filter
ja: ファイル名フィルタ

source: File name:
ja: ファイル名:

source: File structure popup
ja: ファイル構造ポップアップ

source: File templates
ja: ファイル テンプレート

source: File types
ja: ファイル タイプ

source: File {0}
ja: ファイル {0}

source: File {0} already exists Do you want overwrite it or to append?
ja: ファイル {0} は既に存在しています 上書きまたは追加しますか ?

source: File {0} does not exist.
ja: ファイル{0}は存在しません。

source: File {0} is read-only
ja: ファイル {0} は読み取り専用です

source: Files
ja: ファイル

source: Files Are Different
ja: ファイルは異なります

source: Files Are Identical
ja: ファイルは同一です

source: Files in Previous Search Result
ja: 前回の検索結果のファイル

source: Files of this type cannot be opened in {0}
ja: このタイプのファイルは {0} で開けません

source: Filter Settings
ja: フィルタ設定

source: Filter TODO Items
ja: TODO アイテムをフィルタ

source: Filter name should be specified
ja: フィルタ名を指定してください

source: Filter should contain at least one pattern
ja: フィルタには少なくとも 1 つのパターンが必要です

source: Filter targets
ja: ターゲットをフィルタ

source: Filter with the same name already exists
ja: 同じ名前のフィルタが既に存在します

source: Filters
ja: フィルタ

source: Final Modifier
ja: Final 修飾子

source: Finalization issues
ja: 終了処理問題

source: Find
ja: 検索

source: Find &All
ja: すべて検索(&A)

source: Find Duplicates
ja: 重複の検索

source: Find Next
ja: 次を検索

source: Find Previous
ja: 前を検索

source: Find Text
ja: 文字列の検索

source: Find Usages
ja: 使用箇所の検索

source: Find Usages in File
ja: ファイル内の使用箇所の検索

source: Find in Path
ja: パスの検索

source: Finish lookup by Ctrl+Dot
ja: Ctrl+ピリオドでルックアップを終了

source: Finish lookup by exclamation mark
ja: 感嘆符でルックアップを終了

source: Finish lookup by special characters
ja: 特殊文字でルックアップを終了

source: Firefox Settings
ja: Firefox設定

source: First Stroke
ja: 最初のストローク

source: First Stroke:
ja: 最初のストローク:

source: Fix
ja: 修復

source: Fix Javadoc
ja: Javadoc の修復

source: Fix Modifiers
ja: 修飾子の修復

source: Fix Parameter Type
ja: パラメータの型の修復

source: Fix Return Type
ja: 戻り型の修復

source: Fix Super Method Return Type
ja: スーパー メソッドの戻り型の修復

source: Fix Throws List
ja: Throws リストの修復

source: Fix Variable Type
ja: 変数の型の修復

source: Font
ja: フォントタイプ

source: Font:
ja: フォント:

source: Footer
ja: フッタ

source: For all classes that override 'toString()' method
ja: 'toString()' メソッドをオーバーライドするすべてのクラス

source: For classes from the list:
ja: リストからのクラス:

source: For example if you have a call to parametrized method like:
ja: 例えば、次のようなパラメータ化されたメソッドへの呼び出しを行う場合 :

source: For example if you have the following code:
ja: 例えば、以下のコードの場合 :

source: For example:
ja: 例:

source: For statement
ja: ステートメント

source: Foreground
ja: 前景

source: Forward
ja: 次へ

source: Fro&m cursor
ja: カーソルから(&M)

source: From сlipboard
ja: クリップボード

source: Fully qualified name of a class:
ja: クラスの完全修飾名:

source: GUI Designer forms
ja: GUI デザイナ フォーム

source: General
ja: 一般

source: General Options
ja: 一般オプション

source: Generalize Catch
ja: キャッチの一般化

source: Generalize catch for ''{0}'' to ''{1}''
ja: ''{0}'' のキャッチを ''{1}'' に一般化する

source: Generate
ja: 生成

source: Generate "<p>" on empty lines
ja: 空白行に "<p/>" を生成する

source: Generate &hyperlinks to classes
ja: クラスへのハイパーリンクを生成する(&H)

source: Generate 'equals()'
ja: 'equals()'の生成

source: Generate 'hashCode()'
ja: 'hashCode()'の生成

source: Generate JavaDoc
ja: JavaDoc の生成

source: Generate equals() and hashCode()
ja: equals() と hashCode() の生成

source: Generate hierarchy tree
ja: 階層ツリーを生成する

source: Generate index
ja: インデックスを生成する

source: Generate multiple-file ant build (requires ant 1.6 or later to execute)
ja: マルチ ファイル ant ビルドの生成 (ant 1.6 またはそれ以降が必要)

source: Generate navigation bar
ja: ナビゲーション バーを生成する

source: Generate single-file ant build
ja: シングル ファイルとビルドの生成

source: Generated equals() for Object[] can be incorrect
ja: 生成された Object[] の equals() は不正です

source: Generating HTML...
ja: HTML を生成中...

source: Generating HTML:{0}
ja: HTML を生成しています :{0}

source: Generating file: {0}
ja: ファイルを生成しています: {0}

source: Generation options for javadoc not specified
ja: Javadoc の生成オプションが指定されていません

source: Generify File
ja: ファイルの一般化

source: Global Code Style
ja: グローバル コード スタイル

source: Global Libraries
ja: グローバル ライブラリ

source: Global code style settings can be configured<br>in IDE Settings/Global Code Style</body></html>
ja: グローバル コード スタイルは<br>[IDE 設定] - [グローバル コード スタイル] で設定できます。</body></html>

source: Go Next Problem
ja: 次の問題へ

source: Go Prev Problem
ja: 前の問題へ

source: Go to Line
ja: 行に移動

source: Go to class
ja: クラスに移動

source: Go to declaration
ja: 宣言に移動

source: Go to file
ja: ファイルに移動

source: Go to high priority problems only
ja: エラー箇所に移動する

source: Go to implementation
ja: 実装に移動

source: Go to line which caused exception when opening test source
ja: テスト ソースを開いたときに例外が発生する行に移動

source: Go to next problem
ja: 次のエラー/警告に移動する

source: Go to next split
ja: 次の分割画面に移動

source: Go to previous split
ja: 前の分割画面に移動

source: Go to symbol
ja: シンボルに移動

source: Group
ja: グループ

source: Group By Modules
ja: モジュール別にグループ化

source: Group By Packages
ja: パッケージ別にグループ化

source: Group Methods by Defining Type
ja: メソッドをタイプ定義別にグループ化

source: Group by Scope Type
ja: スコープ タイプ別にグループ化

source: Group by Scope Type (production, test, libraries)
ja: スコープ タイプ別にグループ化 (製品、テスト、ライブラリ)

source: Group by cl&asses
ja: クラス単位でグループ化する(&A)

source: Group by me&thods
ja: メソッド単位でグループ化する(&T)

source: Guarded Block Modification Attempt
ja: 保護ブロックへの変更

source: Gutter//Background
ja: ガター バックグラウンド

source: HTML 'style' attribute
ja: HTML 'style'属性

source: HTML code
ja: HTMLコード

source: HTML files
ja: HTML ファイル

source: HTML files will be exported to this directory
ja: HTML へのエクスポート

source: HTTP Proxy
ja: HTTP プロキシ

source: HTTP Proxy Settings
ja: HTTPプロキシ設定

source: HTTP Result code: {0}
ja: HTTP 結果コード : {0}

source: Hardcoded string literals are probably errors in an internationalized environment.
ja: ハードコードされている文字列リテラルは、国際化環境でエラーになる場合があります。

source: Has implementations
ja: 実装を保持しています

source: Has subclasses
ja: サブクラスを保持します

source: Header
ja: ヘッダ

source: Header and Footer
ja: ヘッダーとフッター

source: Help
ja: ヘルプ

source: Help topic "{0}" not found
ja: ヘルプ トピック "{0}" が見つかりません

source: Hex prefix:
ja: 16 進値の接頭辞:

source: Hide All _Windows
ja: すべてのウィンドウを閉じる(_W)

source: Hide Empty Middle Packages
ja: 空の中間パッケージの非表示

source: Hide Global Inspections
ja: グローバル検査の非表示

source: Hide Global Inspections Settings
ja: グローバル検査設定の非表示

source: Hide classes where the method is legally not implemented
ja: メソッドが正式に実装されていないクラスを非表示

source: Hide file extension in editor tabs
ja: エディタ タブでファイル拡張子は表示しない

source: Hide notification
ja: 通知の非表示

source: Hide warnings
ja: 警告の非表示

source: Hierarchy of {0}
ja: {0} の階層

source: Highlight current scope
ja: 現在のスコープを強調表示する

source: Highlight matched brace
ja: 組になる中括弧を強調表示する

source: Highlight on Caret Movement
ja: 中括弧の強調表示

source: Highlighting Level
ja: 強調表示レベル

source: Home
ja: Home キー

source: Home directory is not specified for JDK
ja: JDK のホーム ディレクトリが指定されていません

source: Home page:
ja: ホーム ページ:

source: Host:
ja: ホスト:

source: Hot Swap
ja: ホット スワップ

source: Hot Swap completed with warnings
ja: ホット スワップは警告で終了しました

source: Hot Swap failed.
ja: ホットスワップは失敗しました。

source: Html file not specified
ja: Html ファイルが指定されていません

source: I do not have a previous version of {0} or I do not want to import my settings
ja: IntelliJ IDEA の旧バージョンがインストールされていない、または旧バージョンの設定をインポートしない

source: I/O error
ja: I/O エラー

source: IDE Fatal Errors
ja: IDE の致命的なエラー

source: IDE Settings
ja: IDE 設定

source: IDEA (4.5 default)
ja: IDEA (4.5 デフォルト)

source: INFORMATION
ja: 情報

source: INVALID
ja: 無効

source: ITN returns wrong data
ja: ITN は不正なデータを返しました

source: Icon
ja: アイコン

source: Icon:
ja: アイコン:

source: Idea Module
ja: Idea モジュール

source: Idea Project
ja: Idea プロジェクト

source: Idea Workspace
ja: Idea ワークスペース

source: Identifier expected instead of ''{0}''
ja: ''{0}'' の代わりの識別子が必要です

source: If all local usages of a field are preceded by assignments to that field, the field can be removed and its usages replaced with local variables.
ja: そのフィールドへの代入がフィールドのローカルの使用箇所すべてに先行する場合、フィールドは削除され、その使用箇所はローカル変数と置換されます。

source: Ignore
ja: 無視

source: Ignore elements marked as @deprecated
ja: @deprecated としてマークされた要素を無視する

source: Ignore files and folders
ja: 次のファイルとフォルダは無視する:

source: Ignore period problems
ja: ピリオド問題の無視

source: Illegal package dependencies
ja: 不正なパッケージ依存関係

source: Illegal scheme name
ja: 不正なスキーム名

source: Implement Method
ja: メソッドの実装

source: Implement methods
ja: メソッドの実装

source: Implementing Classes
ja: クラスの実装

source: Implementing Methods
ja: メソッドの実装

source: Import &popup
ja: ポップアップのインポート(&P)

source: Import File Location
ja: インポートするファイルの場所

source: Import Layout
ja: レイアウトのインポート

source: Import class
ja: クラスのインポート

source: Import...
ja: インポート...

source: Imports
ja: インポート

source: In &whole project
ja: プロジェクト全体(&J)

source: In Ternary Operator (?:)
ja: 三項演算子 (?:) 内

source: In code:
ja: コード内:

source: In declarations:
ja: 宣言内:

source: In empty tag
ja: 空のタグ内

source: In order to generate ant build script, please select the "main" (representative) module for each dependency cycle.
ja: ant ビルド スクリプトを生成するには、各依存関係の "main" (代表) モジュールを選択してください。

source: In s&ingle module
ja: シングル モジュール(&S)

source: In this template, you can specify a code fragment to be included into file templates (Templates tab) with the help of the #parse directive.
ja: このテンプレートでは、#parseディレクティブを使用してファイル テンプレート (テンプレート> タブ) にインクルードするコード フラグメントを指定できます。

source: Include
ja: インクルード

source: Include &non-&&project classes
ja: 非プロジェクト クラスを含める(&N)

source: Include &non-&&project symbols
ja: 非プロジェクト シンボルを含める(&N)

source: Include Recursively
ja: 再帰的にインクルード

source: Include o&verloaded methods
ja: オーバーロードされたメソッドを含める(&V)

source: Include subdirectories
ja: サブディレクトリを含む

source: Include subpackages
ja: サブパッケージを含む

source: Incompatible thread state: thread not suspended
ja: 互換のないスレッド状態: スレッドはサスペンドしていません

source: Incompatible types for ''{0}'' operation
ja: ''{0}'' 演算に非互換の型です

source: Inconsistent debug information
ja: 矛盾したデバッグ情報

source: Incorrect File Type
ja: 不正なファイル タイプ

source: Incorrect annotation syntax: {0}
ja: 不正な注釈構文 : {0}

source: Incorrect function.
ja: 不正な関数です。

source: Increase Font Size
ja: フォントサイズ拡大

source: Increase the maximum heap size in Project Properties|Compiler settings.
ja: 最大ヒープ サイズは [プロジェクト設定] - [コンパイラ] で増加します。

source: Indent Block
ja: ブロックにインデントする

source: Indent Each Line
ja: 各行にインデントする

source: Indent must be multiple of tab size for smart tabs to operate
ja: インデントは、操作するスマート タブのタブ文字数の倍数にする必要があります

source: Indent:
ja: インデント:

source: Information
ja: 情報

source: Inheritance issues
ja: 継承問題

source: Initialization issues
ja: 初期化問題

source: Initializer for ''{0}'' has incompatible type
ja: ''{0}'' の初期化子は非互換の型です

source: Initializer type is not assignment-compatible with array's component type
ja: 初期化子の型は、配列コンポーネント タイプと代入互換がありません

source: Inner class
ja: 内部クラス

source: Inner classes
ja: 内部クラス

source: Input
ja: 入力

source: Input new favorites list name
ja: 新規お気に入りリストの名前を入力してください

source: Insert
ja: 挿入

source: Insert ''({0}){1}'' declaration
ja: ''({0}){1}'' 宣言を挿入する

source: Insert '('
ja: '(' を挿入する

source: Insert '()'
ja: '()' を挿入する
